
# CLI tools
brew "git"
brew "wget"
brew "curl"
brew "tree"
brew "jq"
brew "fzf"
brew "stow"

# asdf for language management
brew "asdf"
brew "maven"

# ZSH Shell
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Databases and services

# GUI apps
cask "iterm2"
cask "visual-studio-code"
cask "sublime-text"
cask "intellij-idea"
cask "notion"
